In [1]:
import pandas as pd

# Part I: Exploratory analysis

> Read the dataset correctly using pandas, using an appropriate column as index

In [2]:
data = pd.read_csv("titanic.csv", index_col = "PassengerId")

# using the parameter index_col when we read the file it utilises the column we specify as the index
# alternatively can use set_index

In [3]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
5,0,3,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

> Compute the percentage of survivors out of total number of passengers and the percentage of men and women out of total number of passengers

In [5]:
survivors = data["Survived"].value_counts()
survivors

0    549
1    342
Name: Survived, dtype: int64

In [6]:
survivors_ratio = (survivors / len(data)).round(2) 
survivors_ratio

# len(data) is the length of no. of rows in the dataset

0    0.62
1    0.38
Name: Survived, dtype: float64

In [7]:
gender = data["Sex"].value_counts()
gender

male      577
female    314
Name: Sex, dtype: int64

In [8]:
gender_ratio = (gender / len(data)).round(2)
gender_ratio

male      0.65
female    0.35
Name: Sex, dtype: float64

> Compute the percentage of survivors by sex (i.e. the percentage of male passengers that survived and female passengers that survived) and the sex distribution of survivors (i.e. percentage of survivors that were men and percentage of survivors that were women)

In [9]:
data.loc[:,["Survived","Sex"]].value_counts()

Survived  Sex
0         male      468
1         female    233
          male      109
0         female     81
dtype: int64

In [10]:
number_of_male_survivors = 109
number_of_female_survivors = 233
number_of_male_deaths = 468
number_of_female_deaths = 81

In [11]:
percent_of_male_passengers_survivors = (number_of_male_survivors / gender[0]).round(2)
percent_of_male_passengers_survivors

0.19

In [12]:
percent_of_female_passengers_survivors = (number_of_female_survivors / gender[1]).round(2)
percent_of_female_passengers_survivors

0.74

In [13]:
percent_of_survivors_that_are_male = (number_of_male_survivors / survivors[1]).round(2)
percent_of_survivors_that_are_male

0.32

In [14]:
percent_of_survivors_that_are_female = (number_of_female_survivors / survivors[1]).round(2)
percent_of_survivors_that_are_female

0.68

> Display in a 2 x 2 DataFrame the probability of being male/female and surviving/not surviving

In [15]:
Alive = data["Survived"] == 1
Dead = data["Survived"] == 0

In [16]:
data["Alive"] = Alive
data["Dead"] = Dead
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alive,Dead
PassengerId,,,,,,,,,,,,,
1,0,3,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
2,1,1,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C,True,False
3,1,3,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False
4,1,1,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S,True,False
5,0,3,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S,False,True

In [17]:
male_survivors_overall = round((number_of_male_survivors / len(data)),2)
male_survivors_overall

0.12

In [18]:
female_survivors_overall = round((number_of_female_survivors / len(data)),2)
female_survivors_overall

0.26

In [19]:
male_deaths_overall = round((number_of_male_deaths / len(data)),2)
male_deaths_overall

0.53

In [20]:
female_deaths_overall = round((number_of_female_deaths / len(data)),2)
female_deaths_overall

0.09

#### Method 1

In [21]:
round(data.groupby(["Sex"])[["Alive", "Dead"]].sum()/(len(data)),2)

        Alive  Dead
Sex
female   0.26  0.09
male     0.12  0.53

#### Method 2

In [22]:
pd.DataFrame(
    data = [[male_survivors_overall,male_deaths_overall],[female_survivors_overall,female_deaths_overall]],
    index = ["Male","Female"],
    columns=['Alive','Dead'])

        Alive  Dead
Male     0.12  0.53
Female   0.26  0.09

> Display in a DataFrame the probability of survival/not survival of all combinations of sex and class

In [23]:
round(data.groupby(["Sex", "Pclass"])[["Alive", "Dead"]].sum()/(len(data)),2)

               Alive  Dead
Sex    Pclass
female 1        0.10  0.00
       2        0.08  0.01
       3        0.08  0.08
male   1        0.05  0.09
       2        0.02  0.10
       3        0.05  0.34

# Part II: Imputing missing values

> Devise two different strategies to impute the missing values in the Age column

#### Method 1 - Start

In [24]:
data["Age"].isnull().sum()

177

In [25]:
age = data["Age"]
age

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [26]:
median_of_age = age.median()
median_of_age

28.0

In [27]:
method_1 = age.fillna(median_of_age)
method_1

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889    28.0
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [28]:
method_1.isnull().sum()

0

In [29]:
data.insert(loc = 5, column = 'Age_Median', value = method_1)
data.head()

,Survived,Pclass,Name,Sex,Age,Age_Median,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alive,Dead
PassengerId,,,,,,,,,,,,,,
1,0,3,Mr. Owen Harris,male,22.0,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
2,1,1,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,38.0,1,0,PC 17599,71.2833,C85,C,True,False
3,1,3,Miss. Laina,female,26.0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False
4,1,1,Mrs. Jacques Heath (Lily May Peel),female,35.0,35.0,1,0,113803,53.1000,C123,S,True,False
5,0,3,Mr. William Henry,male,35.0,35.0,0,0,373450,8.0500,NaN,S,False,True

#### Method 1 - End

#### Method 2 - Start

In [30]:
temporary_name_value_holder = data["Name"].explode().str.split(".")
temporary_name_value_holder
# we use explode() to create a list of each element
# str.split() to split on a specified delimitter

PassengerId
1                                 [Mr,  Owen Harris]
2      [Mrs,  John Bradley (Florence Briggs Thayer)]
3                                     [Miss,  Laina]
4              [Mrs,  Jacques Heath (Lily May Peel)]
5                               [Mr,  William Henry]
                           ...
887                                   [Rev,  Juozas]
888                          [Miss,  Margaret Edith]
889                [Miss,  Catherine Helen "Carrie"]
890                               [Mr,  Karl Howell]
891                                   [Mr,  Patrick]
Name: Name, Length: 891, dtype: object

In [31]:
prefix = []
for index_number in range(1,len(temporary_name_value_holder)+1):
    variable = temporary_name_value_holder[index_number]
    prefix.append(variable[0])

# using a for loop we extract the first element of every list in the name column
# we then append it to the empty list 'prefix'

In [32]:
print(len(prefix)) 

# checking the length of prefix to ensure we have the correct no. of variables

891

In [33]:
data.insert(loc = 2, column = 'Prefix', value = prefix)
data.head()

# appending newly created list prefix to the dataset at a specified position

,Survived,Pclass,Prefix,Name,Sex,Age,Age_Median,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alive,Dead
PassengerId,,,,,,,,,,,,,,,
1,0,3,Mr,Mr. Owen Harris,male,22.0,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
2,1,1,Mrs,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,38.0,1,0,PC 17599,71.2833,C85,C,True,False
3,1,3,Miss,Miss. Laina,female,26.0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False
4,1,1,Mrs,Mrs. Jacques Heath (Lily May Peel),female,35.0,35.0,1,0,113803,53.1000,C123,S,True,False
5,0,3,Mr,Mr. William Henry,male,35.0,35.0,0,0,373450,8.0500,NaN,S,False,True

In [34]:
# Find all the different prefixes that exist in the data

data["Prefix"].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)

In [35]:
# Show the average age per prefix - this will be used to impute the missing values according to the passenger's prefix

prefix_groups = data.groupby("Prefix")[["Age"]].mean().round()
prefix_groups

               Age
Prefix
Capt          70.0
Col           58.0
Don           40.0
Dr            42.0
Jonkheer      38.0
Lady          48.0
Major         48.0
Master         5.0
Miss          22.0
Mlle          24.0
Mme           24.0
Mr            32.0
Mrs           36.0
Ms            28.0
Rev           43.0
Sir           49.0
the Countess  33.0

In [36]:
# Indexing the mean age for passengers whose prefix is "Miss"

prefix_groups["Age"]["Miss"]

22.0

In [37]:
# Creating a new column in the data called Age_by_Prefix (this is a copy of the age colum)
# The missing values of this new column will then be replaced by the mean according to the prefix

data.insert(loc = 7, column = 'Age_by_Prefix', value = data["Age"])
data.head()

,Survived,Pclass,Prefix,Name,Sex,Age,Age_Median,Age_by_Prefix,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alive,Dead
PassengerId,,,,,,,,,,,,,,,,
1,0,3,Mr,Mr. Owen Harris,male,22.0,22.0,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
2,1,1,Mrs,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,38.0,38.0,1,0,PC 17599,71.2833,C85,C,True,False
3,1,3,Miss,Miss. Laina,female,26.0,26.0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False
4,1,1,Mrs,Mrs. Jacques Heath (Lily May Peel),female,35.0,35.0,35.0,1,0,113803,53.1000,C123,S,True,False
5,0,3,Mr,Mr. William Henry,male,35.0,35.0,35.0,0,0,373450,8.0500,NaN,S,False,True

In [38]:
# creating a function that will evaluate the prefix of the passenger and will return the corresponding mean
def fill_null_age_rows(row):
    for value in data["Prefix"].unique():
        if row["Prefix"] == value:
            return prefix_groups["Age"][value]

In [39]:
# Apply the function on the Age_by_Prefix colum to fill the nas
data["Age_by_Prefix"] = data["Age_by_Prefix"].fillna(data.apply(fill_null_age_rows, axis=1)) 

# This results in Age_by_Pefix being equal to Age and equal to the relevant mean according to prefix when age is null.
data.head()

,Survived,Pclass,Prefix,Name,Sex,Age,Age_Median,Age_by_Prefix,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alive,Dead
PassengerId,,,,,,,,,,,,,,,,
1,0,3,Mr,Mr. Owen Harris,male,22.0,22.0,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
2,1,1,Mrs,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,38.0,38.0,1,0,PC 17599,71.2833,C85,C,True,False
3,1,3,Miss,Miss. Laina,female,26.0,26.0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False
4,1,1,Mrs,Mrs. Jacques Heath (Lily May Peel),female,35.0,35.0,35.0,1,0,113803,53.1000,C123,S,True,False
5,0,3,Mr,Mr. William Henry,male,35.0,35.0,35.0,0,0,373450,8.0500,NaN,S,False,True

In [40]:
# Checking that the Age_by_Prefix column no longer has null values
data["Age_by_Prefix"].isnull().sum()

0

#### Method 2 - End

#### Method 2 Alternative - Start

In [41]:
temporary_new_age_value_holder = data["Age"].fillna("empty")
temporary_new_age_value_holder

# creating a variable 'temporary_new_age_value_holder' to hold a modified age column where NaN is replaced by the string empty

PassengerId
1       22.0
2       38.0
3       26.0
4       35.0
5       35.0
       ...
887     27.0
888     19.0
889    empty
890     26.0
891     32.0
Name: Age, Length: 891, dtype: object

In [42]:
empties = temporary_new_age_value_holder == "empty"

# storing modified age column into a variable 'empties'

In [43]:
data.loc[empties,["Prefix"]].value_counts()

# counting number of 'empty' based off each prefix

Prefix
Mr        119
Miss       36
Mrs        17
Master      4
Dr          1
dtype: int64

In [44]:
mrs = data["Prefix"] == "Mrs"
mr = data["Prefix"] == "Mr"
miss = data["Prefix"] == "Miss"
master = data["Prefix"] == "Master"
dr = data["Prefix"] == "Dr"

# storing only the prefixes with null values into variables

> Calculating the mean for each prefix with an empty

In [45]:
data.loc[mrs,["Age"]].mean().round()

Age    36.0
dtype: float64

In [46]:
data.loc[miss,["Age"]].mean().round()

Age    22.0
dtype: float64

In [47]:
data.loc[master,["Age"]].mean().round()

Age    5.0
dtype: float64

In [48]:
data.loc[dr,["Age"]].mean().round()

Age    42.0
dtype: float64

In [49]:
data.loc[(data["Age"].isnull()) & (data["Prefix"] == "Mrs"), "Age"] = 36.0
data.loc[(data["Age"].isnull()) & (data["Prefix"] == "Mr"), "Age"] = 32.0
data.loc[(data["Age"].isnull()) & (data["Prefix"] == "Master"), "Age"] = 5.0
data.loc[(data["Age"].isnull()) & (data["Prefix"] == "Miss"), "Age"] = 22.0
data.loc[(data["Age"].isnull()) & (data["Prefix"] == "Dr"), "Age"] = 42.0

# assigning mean age only to specific value in prefix with a null value

In [50]:
data["Age"].isnull().sum()

# ensuring our method worked

0

#### Method 2 Alternative - End

> Compare the two strategies by computing the standard deviation of the overall Age column after applying each of them, as well as the standard deviation of the age of each group of sex and class

In [51]:
round(data["Age"].std(),2)

13.26

In [52]:
round(method_1.std(),2)

13.02

In [53]:
round(data.groupby(["Sex", "Pclass"])[["Age_Median", "Age_by_Prefix"]].std(), 2)

               Age_Median  Age_by_Prefix
Sex    Pclass
female 1            13.08          13.01
       2            12.70          12.75
       3            11.07          11.24
male   1            14.66          14.19
       2            14.18          14.16
       3            10.40          10.93